#include <iostream>
#include "tasks.h"
#include <ctime> 
using namespace std;

void main()
{
	setlocale(LC_ALL, "RUSSIAN");
	srand(unsigned(time(0)));

	//Задание1 
	double a1, a2, a3;
	//ВВод
	cin >> a1 >> a2 >> a3;

	cout << "Периметр треугольника со сторонами" << " " << a1 << " " << a2 << " " << a3 << " " << perimeter(a1, a2, a3);
	cout << endl;

	//Задание2

	double x1, y1, x2, y2;
	//ВВод
	cin >> x1 >> y1 >> x2 >> y2;

	cout << "Расстояние между 2 точками" << " " << dist(x1, y1, x2, y2);
	cout << endl;

	//Задание3
	
	cout << "Площадь треугольника" << " " << areaFromSides(a1, a2, a3);
	cout << endl;

	//Задание4

	double z1, u1, p1, z2, u2, p2;

	//ВВод
	cin >> z1 >> z2 >> u1 >> u2 >> p1 >> p2;

	cout << "Площадь треугольника по точкам" << " " << areaFromPos(z1, z2, u1, u2, p1, p2);
	cout << endl;
	

	//Задание5

	double x;
	//ВВод
	cin >> x;

	cout << "Наибольшее целое число, которое не превышает кубического корня заданного числа" << ' ' << floorCubicRoot(x);
	cout << endl;

	
	//Задание6

	double z, y;
	//ВВод
	cin >> z >> y;

	cout << "Логарифм числа" << ' ' << z << ' ' << "по основанию" << ' ' << ' ' << y << ' ' << "равен" << ' ' << MyLog(z, y);
	cout << endl;
	

	//Задание7
	double d1, d2, j1, j2;

	//ВВод
	cin >> d1 >> j1 >> d2 >> j2;

	cout << "Площадь прямоугольника" << ' ' << RectS(d1, j1, d2, j2);
	cout << endl;


	//Задание8
	int n, b;

	//ВВод
	cin >> n >> b;

	cout << "Случайное число от 0 до " << n << ' ' << random(n);
	cout << endl;

	

	//Задание9

	cout << "Случайное число от " << n << " до " << b << ' ' << random(n, b);
	cout << endl;

	cout << "Случайное вещественное число " << random();
	cout << endl;

	system("pause");

	/*
4
5
6
Периметр треугольника со сторонами 4 5 6 15
12
22
33
51
Расстояние между 2 точками 35.805
Площадь треугольника 9.92157
45
55
11
22
33
66
Площадь треугольника по точкам 385
124
Наибольшее целое число, которое не превышает кубического корня заданного числа 4
241
241
Логарифм числа 241 по основанию  241 равен 1
22
555
898
515
Площадь прямоугольника 35040
44
55
Случайное число от 0 до 44 35
Случайное число от 44 до 55 53
Случайное вещественное число 0.96176
	*/
}
